In [8]:
import pandas as pd
import numpy as np
import pyodbc as pyodbc
import time_series as ts

In [9]:
ts.df

,Date_1,data,Date_2,Date_Diff,Date_Diff_Seconds
0,2000-01-01 00:00:00,4,2003-01-23 00:00:00,1118 days 00:00:00,96595200.0
1,2000-01-01 00:01:00,10,2003-01-23 00:00:30,1117 days 23:59:30,96595170.0
2,2000-01-01 00:02:00,7,2003-01-23 00:01:00,1117 days 23:59:00,96595140.0
3,2000-01-01 00:03:00,3,2003-01-23 00:01:30,1117 days 23:58:30,96595110.0
4,2000-01-01 00:04:00,7,2003-01-23 00:02:00,1117 days 23:58:00,96595080.0
5,2000-01-01 00:05:00,8,2003-01-23 00:02:30,1117 days 23:57:30,96595050.0
6,2000-01-01 00:06:00,2,2003-01-23 00:03:00,1117 days 23:57:00,96595020.0

In [10]:
ts.agg_df

,data,Date_Diff_Mean,Date_Diff_Sum,Date_Diff_Secs_Mean,Date_Diff_Secs_Sum
0,2,1117 days 23:57:00,1117 days 23:57:00,96595020.0,96595020.0
1,3,1117 days 23:58:30,1117 days 23:58:30,96595110.0,96595110.0
2,4,1118 days 00:00:00,1118 days 00:00:00,96595200.0,96595200.0
3,7,1117 days 23:58:30,2235 days 23:57:00,96595110.0,193190220.0
4,8,1117 days 23:57:30,1117 days 23:57:30,96595050.0,96595050.0
5,10,1117 days 23:59:30,1117 days 23:59:30,96595170.0,96595170.0

#### Connect to sql server db and load ts.df dataset

In [11]:
DRIVER = "SQL Server"
SERVER_NAME = "LAPTOP-S1EISQB0"
DB_NAME = "newdb"

In [12]:
conn_str = (f"Driver={DRIVER};Server={SERVER_NAME};Database={DB_NAME};Trusted_Connection=yes;")
conn = pyodbc.connect(conn_str)
conn.autocommit = True 
cursor = conn.cursor()

In [13]:
# query to create table
ddl_query = """
drop table if exists exp_dataset_2;
create table exp_dataset (
    Date_1 datetime not null,
    Date_2 datetime not null,
    Data smallint not null,
    Constraint PK_ts_ID Primary Key (Date_1, Date_2)
);
"""

In [14]:
cursor.execute(ddl_query)